APC10x4.5Static/prepDirs/5425rpmPre/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [m s^-1];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        //value           $internalField;
    }

    walls
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
    }

    hub
    {
        type            uniformFixedValue;
    	uniformValue    uniform (0 0 0);
    }
    
    symY
    {
        type            cyclic;
    }

    symZ
    {
        type            cyclic;
    }

    /* symY
    {
        type            symmetryPlane;
    }

    symZ
    {
        type            symmetryPlane;
    } */
}


// ************************************************************************* //
